УТ_для_edt/src/InformationRegisters/смартТарифыНаДоставку/смартТарифыНаДоставку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>смартТарифыНаДоставку</name>
  <comment>//++ #Б674 смарт: Шляпников 25.03.2025 / Отчет по кол-ву платных доставок, ИТСМ 1959</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>СкидкаНаценка</name>
    <type>
      <types>CatalogRef.СкидкиНаценки</types>
    </type>
  </resources>
  <resources>
    <name>СтоимостьДоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НеИспользуется</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Регион</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>СуммаЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВесЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Город</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Расстояние</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>СегментКлиента</name>
    <comment>//++ #Б5448 смарт: Шляпников 23.01.2026 / Документ Заказ клиента. Установка тарифа доставки для приоритетных клиентов.</comment>
    <type>
      <types>CatalogRef.СегментыПартнеров</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/InformationRegisters/СостоянияЗаказовКлиентов/СостоянияЗаказовКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостоянияЗаказовКлиентов</name>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияЗаказовКлиентов</types>
      <types>EnumRef.СостоянияЗаявокНаВозвратТоваровОтКлиентов</types>
    </type>
  </resources>
  <resources>
    <name>ДатаСобытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СуммаОплаты</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентОплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаОтгрузки</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентОтгрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДолга</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентДолга</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьРасхожденияОрдерНакладная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартДокументыПодписаны</name>
    <comment>//++ #1650 смарт:Шляпников 17.09.2024 //Отметка &quot;Оригиналы документов получены&quot; (Заказ клиента) при частичной отгрузке (1650)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартНаценкаПоДоставкеРассчитана</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартНаценкаПоДоставке</name>
    <type>
      <types>CatalogRef.СкидкиНаценки</types>
    </type>
  </attributes>
  <attributes>
    <name>смартНаценкаПоДоставкеСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартНаценкаПоДоставкеРассчитанаСОшибкой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартНаценкаПоДоставкеОписаниеОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартНаценкаПоДоставкеПоТарифу</name>
    <type>
      <types>CatalogRef.СкидкиНаценки</types>
    </type>
  </attributes>
  <attributes>
    <name>смартНаценкаПоДоставкеСуммаПоТарифу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</types>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Enums/СпособыДоставки/СпособыДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыДоставки</name>
  <enumValues>
    <name>Самовывоз</name>
  </enumValues>
  <enumValues>
    <name>ДоКлиента</name>
  </enumValues>
  <enumValues>
    <name>СиламиПеревозчика</name>
  </enumValues>
  <enumValues>
    <name>СиламиПеревозчикаПоАдресу</name>
  </enumValues>
  <enumValues>
    <name>СиламиПоставщикаДоНашегоСклада</name>
  </enumValues>
  <enumValues>
    <name>СиламиПеревозчикаДоНашегоСклада</name>
  </enumValues>
  <enumValues>
    <name>СиламиПеревозчикаДоПунктаПередачи</name>
  </enumValues>
  <enumValues>
    <name>НашимиСиламиСАдресаОтправителя</name>
  </enumValues>
  <enumValues>
    <name>КПолучателюОпределяетСлужбаДоставки</name>
  </enumValues>
  <enumValues>
    <name>ОтОтправителяОпределяетСлужбаДоставки</name>
  </enumValues>
  <enumValues>
    <name>ПоручениеЭкспедиторуСоСклада</name>
  </enumValues>
  <enumValues>
    <name>ПоручениеЭкспедиторуНаСклад</name>
  </enumValues>
  <enumValues>
    <name>ПоручениеЭкспедиторуВПункте</name>
  </enumValues>
  <enumValues>
    <name>ОпределяетсяВРаспоряжении</name>
  </enumValues>
  <enumValues>
    <name>смартСамовывозСоСкладаАдмирал</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/СостоянияЗаказовКлиентов/СостоянияЗаказовКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияЗаказовКлиентов</name>
  <enumValues>
    <name>ОжидаетсяСогласование</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетсяАвансДоОбеспечения</name>
  </enumValues>
  <enumValues>
    <name>ГотовКОбеспечению</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетсяПредоплатаДоОтгрузки</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетсяОбеспечение</name>
  </enumValues>
  <enumValues>
    <name>ГотовКОтгрузке</name>
  </enumValues>
  <enumValues>
    <name>ВПроцессеОтгрузки</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетсяОплатаПослеОтгрузки</name>
  </enumValues>
  <enumValues>
    <name>ГотовКЗакрытию</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/InformationRegisters/смартТарифыНаДоставку/ManagerModule.bsl
#Область Интерфейс

Функция РассчитатьДоставкуПоЗаказуКлиента(ЗаказКлиента, УчитыватьОтгруженныеЗаказы = Истина, СчитатьПоМаксимальномуТарифу = Ложь) Экспорт
	
	Результат = Новый Структура("ЗаказКлиента,РегионЗаказа,ГородЗаказа,РасстояниеЗаказа,ВесЗаказа,СуммаЗаказа,СкидкаНаценка,СтоимостьДоставки,ДополнительныеДанные");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	МассивТекстов = Новый Массив;
	
	Если ТипЗнч(ЗаказКлиента) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(ДокЗаказ.Ссылка.Партнер) КАК Партнер,
		|	МАКСИМУМ(ДокЗаказ.Ссылка.АдресДоставки) КАК АдресДоставки,
		|	МАКСИМУМ(ДокЗаказ.ДатаОтгрузки) КАК ЖелаемаяДатаОтгрузки,
		|	МАКСИМУМ(ДокЗаказ.Ссылка.СпособДоставки) КАК СпособДоставки
		|ПОМЕСТИТЬ ВТПараметрыЗаказа
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ДокЗаказ
		|ГДЕ
		|	ДокЗаказ.Ссылка = &ЗаказКлиента
		|	И ДокЗаказ.Ссылка.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ДоКлиента)";
		
		МассивТекстов.Добавить(ТекстЗапроса);
		
	Иначе
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	&Партнер КАК Партнер,
		|	&АдресДоставки КАК АдресДоставки,
		|	&ЖелаемаяДатаОтгрузки КАК ЖелаемаяДатаОтгрузки,
		|	&СпособДоставки КАК СпособДоставки
		|ПОМЕСТИТЬ ВТПараметрыЗаказа
		|ГДЕ
		|	&СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ДоКлиента)";
		
		МассивТекстов.Добавить(ТекстЗапроса);
		
		Запрос.УстановитьПараметр("Партнер", ЗаказКлиента.Партнер);
		Запрос.УстановитьПараметр("АдресДоставки", ЗаказКлиента.АдресДоставки);
		Запрос.УстановитьПараметр("СпособДоставки", ЗаказКлиента.СпособДоставки);
		
		ДатаДоставки = ЗаказКлиента.ЖелаемаяДатаОтгрузки;
		Для каждого стрТовары Из ЗаказКлиента.Товары Цикл
			ДатаДоставки = Макс(ДатаДоставки, стрТовары.ДатаОтгрузки);
		КонецЦикла;
		Запрос.УстановитьПараметр("ЖелаемаяДатаОтгрузки", ДатаДоставки);
		
	КонецЕсли;
		
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДокЗаказ.Ссылка КАК Ссылка,
	|	ДокЗаказ.Ссылка.СуммаДокумента КАК СуммаДокумента,
	|	ДокЗаказ.Ссылка.Валюта КАК Валюта
	|ПОМЕСТИТЬ ВТЗаказы
	|ИЗ
	|	ВТПараметрыЗаказа КАК ВТПараметрыЗаказа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ДокЗаказ
	|		ПО ВТПараметрыЗаказа.Партнер = ДокЗаказ.Ссылка.Партнер
	|			И ВТПараметрыЗаказа.АдресДоставки = ДокЗаказ.Ссылка.АдресДоставки
	|			И ВТПараметрыЗаказа.ЖелаемаяДатаОтгрузки = ДокЗаказ.ДатаОтгрузки
	|			И ВТПараметрыЗаказа.СпособДоставки = ДокЗаказ.Ссылка.СпособДоставки
	|			И (ДокЗаказ.Ссылка.Проведен)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияЗаказовКлиентов КАК СостоянияЗаказовКлиентов
	|		ПО (ДокЗаказ.Ссылка = СостоянияЗаказовКлиентов.Заказ)
	|ГДЕ
	|	(НЕ СостоянияЗаказовКлиентов.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияЗаказовКлиентов.Закрыт)
	|				И НЕ СостоянияЗаказовКлиентов.ПроцентОтгрузки = 100
	|			ИЛИ &УчитыватьВсеЗаказы)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТЗаказы.Ссылка КАК Заказ,
	|	СУММА(-ЗаказКлиентаСкидкиНаценки.Сумма) КАК СуммаДоставки
	|ПОМЕСТИТЬ ВТСуммыДоставки
	|ИЗ
	|	ВТЗаказы КАК ВТЗаказы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.СкидкиНаценки КАК ЗаказКлиентаСкидкиНаценки
	|		ПО ВТЗаказы.Ссылка = ЗаказКлиентаСкидкиНаценки.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.смартТарифыНаДоставку.СрезПоследних(&ДатаДоставки, ) КАК смартТарифыНаДоставкуСрезПоследних
	|		ПО (ЗаказКлиентаСкидкиНаценки.СкидкаНаценка = смартТарифыНаДоставкуСрезПоследних.СкидкаНаценка)
	|			И (НЕ смартТарифыНаДоставкуСрезПоследних.НеИспользуется)
	|ГДЕ
	|	ЗаказКлиентаСкидкиНаценки.Ссылка = &ЗаказКлиента
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТЗаказы.Ссылка";
	
	МассивТекстов.Добавить(ТекстЗапроса);
	
	Если ТипЗнч(ЗаказКлиента) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
	
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	МАКСИМУМ(ДанныеОРегионе.Значение) КАК РегионЗаказа,
		|	МАКСИМУМ(ДанныеОГороде.Значение) КАК ГородЗаказа,
		|	МАКСИМУМ(ДанныеОРасстоянии.Значение) КАК РасстояниеЗаказа,
		|	СУММА(ЕСТЬNULL(ВЫРАЗИТЬ(ДанныеОВесе.Значение КАК ЧИСЛО(15, 2)), 0)) КАК ВесЗаказа,
		|	СУММА(ДокЗаказ.СуммаДокумента * КурсыВалютСрезПоследних.Курс / ВЫБОР
		|			КОГДА КурсыВалютСрезПоследних.Кратность = 0
		|				ТОГДА 1
		|			ИНАЧЕ КурсыВалютСрезПоследних.Кратность
		|		КОНЕЦ) - СУММА(ЕСТЬNULL(ВТСуммыДоставки.СуммаДоставки, 0) * КурсыВалютСрезПоследних.Курс / ВЫБОР
		|			КОГДА КурсыВалютСрезПоследних.Кратность = 0
		|				ТОГДА 1
		|			ИНАЧЕ КурсыВалютСрезПоследних.Кратность
		|		КОНЕЦ) КАК Сумма
		|ПОМЕСТИТЬ ВТДанныеДляРасчетаДоставки
		|ИЗ
		|	ВТЗаказы КАК ДокЗаказ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДанныеОРегионе
		|		ПО ДокЗаказ.Ссылка = ДанныеОРегионе.Объект
		|			И (ДанныеОРегионе.Свойство.Имя = ""РегионДоставки"")
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДанныеОГороде
		|		ПО ДокЗаказ.Ссылка = ДанныеОГороде.Объект
		|			И (ДанныеОГороде.Свойство.Имя = ""ГородДоставки"")
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДанныеОВесе
		|		ПО ДокЗаказ.Ссылка = ДанныеОВесе.Объект
		|			И (ДанныеОВесе.Свойство.Имя = ""ВесЗаказа"")
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДанныеОРасстоянии
		|		ПО ДокЗаказ.Ссылка = ДанныеОРасстоянии.Объект
		|			И (ДанныеОРасстоянии.Свойство.Имя = ""РасстояниеДоставки"")
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних КАК КурсыВалютСрезПоследних
		|		ПО ДокЗаказ.Валюта = КурсыВалютСрезПоследних.Валюта
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСуммыДоставки КАК ВТСуммыДоставки
		|		ПО ДокЗаказ.Ссылка = ВТСуммыДоставки.Заказ";
		
		МассивТекстов.Добавить(ТекстЗапроса);
		
		Запрос.УстановитьПараметр("ЗаказКлиента", ЗаказКлиента);
		
	Иначе
		
		СуммаЗаказа = РаботаСКурсамиВалют.ПересчитатьВВалюту(ЗаказКлиента.СуммаДокумента - ПолучитьРассчитаннуюСуммуДоставки(ЗаказКлиента), 
															ЗаказКлиента.Валюта, 
															смартОбщегоНазначенияСКэш.ВалютаРегламентированногоУчета(), 
															ЗаказКлиента.Дата);
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	МАКСИМУМ(Данные.РегионЗаказа) КАК РегионЗаказа,
		|	СУММА(Данные.ВесЗаказа) КАК ВесЗаказа,
		|	СУММА(Данные.Сумма) КАК Сумма,
		|	МАКСИМУМ(Данные.ГородЗаказа) КАК ГородЗаказа,
		|	МАКСИМУМ(Данные.РасстояниеЗаказа) КАК РасстояниеЗаказа
		|ПОМЕСТИТЬ ВТДанныеДляРасчетаДоставки
		|ИЗ
		|	(ВЫБРАТЬ
		|		ДанныеОРегионе.Значение КАК РегионЗаказа,
		|		ДанныеОРегионе.Значение КАК ГородЗаказа,
		|		ДанныеОРасстоянии.Значение КАК РасстояниеЗаказа,
		|		ЕСТЬNULL(ВЫРАЗИТЬ(ДанныеОВесе.Значение КАК ЧИСЛО(15, 2)), 0) КАК ВесЗаказа,
		|		ДокЗаказ.СуммаДокумента * КурсыВалютСрезПоследних.Курс / ВЫБОР
		|			КОГДА КурсыВалютСрезПоследних.Кратность = 0
		|				ТОГДА 1
		|			ИНАЧЕ КурсыВалютСрезПоследних.Кратность
		|		КОНЕЦ - ЕСТЬNULL(ВТСуммыДоставки.СуммаДоставки, 0) * КурсыВалютСрезПоследних.Курс / ВЫБОР
		|			КОГДА КурсыВалютСрезПоследних.Кратность = 0
		|				ТОГДА 1
		|			ИНАЧЕ КурсыВалютСрезПоследних.Кратность
		|		КОНЕЦ КАК Сумма
		|	ИЗ
		|		ВТЗаказы КАК ДокЗаказ
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДанныеОРегионе
		|			ПО ДокЗаказ.Ссылка = ДанныеОРегионе.Объект
		|				И (ДанныеОРегионе.Свойство.Имя = ""РегионДоставки"")
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДанныеОГороде
		|			ПО ДокЗаказ.Ссылка = ДанныеОГороде.Объект
		|				И (ДанныеОГороде.Свойство.Имя = ""ГородДоставки"")
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДанныеОВесе
		|			ПО ДокЗаказ.Ссылка = ДанныеОВесе.Объект
		|				И (ДанныеОВесе.Свойство.Имя = ""ВесЗаказа"")
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДанныеОРасстоянии
		|			ПО ДокЗаказ.Ссылка = ДанныеОРасстоянии.Объект
		|				И (ДанныеОРасстоянии.Свойство.Имя = ""РасстояниеДоставки"")
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних КАК КурсыВалютСрезПоследних
		|			ПО ДокЗаказ.Валюта = КурсыВалютСрезПоследних.Валюта
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВТСуммыДоставки КАК ВТСуммыДоставки
		|			ПО ДокЗаказ.Ссылка = ВТСуммыДоставки.Заказ
		|	ГДЕ
		|		ДокЗаказ.Ссылка <> &ЗаказКлиента
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		&РегионЗаказа,
		|		&ГородЗаказа,
		|		&РасстояниеЗаказа,
		|		&ВесЗаказа,
		|		&СуммаДокумента) КАК Данные";
		
		МассивТекстов.Добавить(ТекстЗапроса);
		
		Запрос.УстановитьПараметр("РегионЗаказа", ЗаказКлиента.ДополнительныеСвойства.Регион);
		Запрос.УстановитьПараметр("ГородЗаказа", ЗаказКлиента.ДополнительныеСвойства.Город);
		Запрос.УстановитьПараметр("ВесЗаказа", ЗаказКлиента.ДополнительныеСвойства.ВесЗаказа);
		Запрос.УстановитьПараметр("РасстояниеЗаказа", ЗаказКлиента.ДополнительныеСвойства.Расстояние);
		Запрос.УстановитьПараметр("СуммаДокумента", СуммаЗаказа);
		Запрос.УстановитьПараметр("ЗаказКлиента", ЗаказКлиента.Ссылка);
		
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ВТЗаказы.Ссылка КАК Ссылка,
	|	ВТЗаказы.СуммаДокумента КАК СуммаДокумента,
	|	ВТЗаказы.Валюта КАК Валюта,
	|	ЕСТЬNULL(ВТСуммыДоставки.СуммаДоставки, 0) КАК СуммаДоставки
	|ИЗ
	|	ВТЗаказы КАК ВТЗаказы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСуммыДоставки КАК ВТСуммыДоставки
	|		ПО ВТЗаказы.Ссылка = ВТСуммыДоставки.Заказ";
	
	МассивТекстов.Добавить(ТекстЗапроса);
	
	Если СчитатьПоМаксимальномуТарифу Тогда
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	МАКСИМУМ(смартТарифыНаДоставкуСрезПоследних.СкидкаНаценка) КАК СкидкаНаценка,
		|	МАКСИМУМ(смартТарифыНаДоставкуСрезПоследних.СтоимостьДоставки) КАК СтоимостьДоставки,
		|	ДанныеОДоставке.РегионЗаказа КАК РегионЗаказа,
		|	ДанныеОДоставке.ВесЗаказа КАК ВесЗаказа,
		|	ДанныеОДоставке.Сумма КАК СуммаЗаказа,
		|	ДанныеОДоставке.РасстояниеЗаказа КАК РасстояниеЗаказа,
		|	ДанныеОДоставке.ГородЗаказа КАК ГородЗаказа,
		|	1 КАК Приоритет,
		|	смартТарифыНаДоставкуСрезПоследних.СегментКлиента КАК СегментКлиента
		|ИЗ
		|	РегистрСведений.смартТарифыНаДоставку.СрезПоследних(&ДатаДоставки, СегментКлиента В (&СегментыКлиента)) КАК смартТарифыНаДоставкуСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДанныеДляРасчетаДоставки КАК ДанныеОДоставке
		|		ПО смартТарифыНаДоставкуСрезПоследних.Регион = ДанныеОДоставке.РегионЗаказа
		|			И смартТарифыНаДоставкуСрезПоследних.ВесЗаказа >= ДанныеОДоставке.ВесЗаказа
		|			И (НЕ смартТарифыНаДоставкуСрезПоследних.НеИспользуется)
		|ГДЕ
		|	смартТарифыНаДоставкуСрезПоследних.СуммаЗаказа >= ДанныеОДоставке.Сумма
		|	И ДанныеОДоставке.Сумма <> 0
		|	И смартТарифыНаДоставкуСрезПоследних.СегментКлиента <> ЗНАЧЕНИЕ(Справочник.СегментыПартнеров.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеОДоставке.РегионЗаказа,
		|	ДанныеОДоставке.ВесЗаказа,
		|	ДанныеОДоставке.Сумма,
		|	ДанныеОДоставке.РасстояниеЗаказа,
		|	ДанныеОДоставке.ГородЗаказа,
		|	смартТарифыНаДоставкуСрезПоследних.СегментКлиента
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	МАКСИМУМ(смартТарифыНаДоставкуСрезПоследних.СкидкаНаценка),
		|	МАКСИМУМ(смартТарифыНаДоставкуСрезПоследних.СтоимостьДоставки),
		|	ДанныеОДоставке.РегионЗаказа,
		|	ДанныеОДоставке.ВесЗаказа,
		|	ДанныеОДоставке.Сумма,
		|	ДанныеОДоставке.РасстояниеЗаказа,
		|	ДанныеОДоставке.ГородЗаказа,
		|	2,
		|	смартТарифыНаДоставкуСрезПоследних.СегментКлиента
		|ИЗ
		|	РегистрСведений.смартТарифыНаДоставку.СрезПоследних(&ДатаДоставки, ) КАК смартТарифыНаДоставкуСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДанныеДляРасчетаДоставки КАК ДанныеОДоставке
		|		ПО смартТарифыНаДоставкуСрезПоследних.Регион = ДанныеОДоставке.РегионЗаказа
		|			И смартТарифыНаДоставкуСрезПоследних.ВесЗаказа >= ДанныеОДоставке.ВесЗаказа
		|			И (НЕ смартТарифыНаДоставкуСрезПоследних.НеИспользуется)
		|ГДЕ
		|	смартТарифыНаДоставкуСрезПоследних.СуммаЗаказа >= ДанныеОДоставке.Сумма
		|	И ДанныеОДоставке.Сумма <> 0
		|	И смартТарифыНаДоставкуСрезПоследних.СегментКлиента = ЗНАЧЕНИЕ(Справочник.СегментыПартнеров.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеОДоставке.РегионЗаказа,
		|	ДанныеОДоставке.ВесЗаказа,
		|	ДанныеОДоставке.Сумма,
		|	ДанныеОДоставке.РасстояниеЗаказа,
		|	ДанныеОДоставке.ГородЗаказа,
		|	смартТарифыНаДоставкуСрезПоследних.СегментКлиента
		|
		|УПОРЯДОЧИТЬ ПО
		|	Приоритет,
		|	СегментКлиента,
		|	ВесЗаказа,
		|	ДанныеОДоставке.Сумма,
		|	ГородЗаказа УБЫВ";
		
	Иначе
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	смартТарифыНаДоставкуСрезПоследних.СкидкаНаценка КАК СкидкаНаценка,
		|	смартТарифыНаДоставкуСрезПоследних.СтоимостьДоставки КАК СтоимостьДоставки,
		|	ДанныеОДоставке.РегионЗаказа КАК РегионЗаказа,
		|	ДанныеОДоставке.ВесЗаказа КАК ВесЗаказа,
		|	ДанныеОДоставке.Сумма КАК СуммаЗаказа,
		|	ДанныеОДоставке.РасстояниеЗаказа КАК РасстояниеЗаказа,
		|	ДанныеОДоставке.ГородЗаказа КАК ГородЗаказа,
		|	1 КАК Приоритет,
		|	смартТарифыНаДоставкуСрезПоследних.СегментКлиента КАК СегментКлиента,
		|	смартТарифыНаДоставкуСрезПоследних.СуммаЗаказа КАК СуммаЗаказаПоТарифу,
		|	смартТарифыНаДоставкуСрезПоследних.ВесЗаказа КАК ВесЗаказаПоТарифу
		|ИЗ
		|	РегистрСведений.смартТарифыНаДоставку.СрезПоследних(&ДатаДоставки, СегментКлиента В (&СегментыКлиента)) КАК смартТарифыНаДоставкуСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДанныеДляРасчетаДоставки КАК ДанныеОДоставке
		|		ПО смартТарифыНаДоставкуСрезПоследних.Регион = ДанныеОДоставке.РегионЗаказа
		|			И смартТарифыНаДоставкуСрезПоследних.ВесЗаказа >= ДанныеОДоставке.ВесЗаказа
		|			И смартТарифыНаДоставкуСрезПоследних.Расстояние >= ДанныеОДоставке.РасстояниеЗаказа
		|			И (НЕ смартТарифыНаДоставкуСрезПоследних.НеИспользуется)
		|			И (смартТарифыНаДоставкуСрезПоследних.Город = ДанныеОДоставке.ГородЗаказа
		|				ИЛИ смартТарифыНаДоставкуСрезПоследних.Город = """")
		|ГДЕ
		|	смартТарифыНаДоставкуСрезПоследних.СуммаЗаказа >= ДанныеОДоставке.Сумма
		|	И ДанныеОДоставке.Сумма <> 0
		|	И смартТарифыНаДоставкуСрезПоследних.СегментКлиента <> ЗНАЧЕНИЕ(Справочник.СегментыПартнеров.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	смартТарифыНаДоставкуСрезПоследних.СкидкаНаценка,
		|	смартТарифыНаДоставкуСрезПоследних.СтоимостьДоставки,
		|	ДанныеОДоставке.РегионЗаказа,
		|	ДанныеОДоставке.ВесЗаказа,
		|	ДанныеОДоставке.Сумма,
		|	ДанныеОДоставке.РасстояниеЗаказа,
		|	ДанныеОДоставке.ГородЗаказа,
		|	2,
		|	смартТарифыНаДоставкуСрезПоследних.СегментКлиента,
		|	смартТарифыНаДоставкуСрезПоследних.СуммаЗаказа,
		|	смартТарифыНаДоставкуСрезПоследних.ВесЗаказа
		|ИЗ
		|	РегистрСведений.смартТарифыНаДоставку.СрезПоследних(&ДатаДоставки, ) КАК смартТарифыНаДоставкуСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДанныеДляРасчетаДоставки КАК ДанныеОДоставке
		|		ПО смартТарифыНаДоставкуСрезПоследних.Регион = ДанныеОДоставке.РегионЗаказа
		|			И смартТарифыНаДоставкуСрезПоследних.ВесЗаказа >= ДанныеОДоставке.ВесЗаказа
		|			И смартТарифыНаДоставкуСрезПоследних.Расстояние >= ДанныеОДоставке.РасстояниеЗаказа
		|			И (НЕ смартТарифыНаДоставкуСрезПоследних.НеИспользуется)
		|			И (смартТарифыНаДоставкуСрезПоследних.Город = ДанныеОДоставке.ГородЗаказа
		|				ИЛИ смартТарифыНаДоставкуСрезПоследних.Город = """")
		|ГДЕ
		|	смартТарифыНаДоставкуСрезПоследних.СуммаЗаказа >= ДанныеОДоставке.Сумма
		|	И ДанныеОДоставке.Сумма <> 0
		|	И смартТарифыНаДоставкуСрезПоследних.СегментКлиента = ЗНАЧЕНИЕ(Справочник.СегментыПартнеров.ПустаяСсылка)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Приоритет,
		|	СегментКлиента,
		|	ВесЗаказаПоТарифу,
		|	СуммаЗаказаПоТарифу,
		|	ГородЗаказа УБЫВ";
		
	КонецЕсли;
	
	МассивТекстов.Добавить(ТекстЗапроса);
	
	Запрос.Текст = СтрСоединить(МассивТекстов, ОбщегоНазначения.РазделительПакетаЗапросов());
	
	Запрос.УстановитьПараметр("ДатаДоставки", ЗаказКлиента.Дата);
	Запрос.УстановитьПараметр("УчитыватьВсеЗаказы", УчитыватьОтгруженныеЗаказы);
	Запрос.УстановитьПараметр("СегментыКлиента", смартОбщегоНазначения.ПолучитьМассивСегментовПартнера(ЗаказКлиента.Партнер));
	
	Пакет = Запрос.ВыполнитьПакет();
	
	Выборка = Пакет[Пакет.Количество() - 1].Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	
	Если ТипЗнч(ЗаказКлиента) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		Результат.ЗаказКлиента = ЗаказКлиента;
	КонецЕсли;
	
	Результат.ДополнительныеДанные = Новый Структура;
	Результат.ДополнительныеДанные.Вставить("Заказы", Пакет[Пакет.Количество() - 2].Выгрузить());
	
	Возврат Результат;
	
КонецФункции

Функция ПроверитьПравильностьРасчетаДоставкиПоЗаказу(ЗаказКлиента, УчитыватьОтгруженныеЗаказы = Истина, ПревышениеСуммыНеСчитаетсяОшибкой = Ложь, СчитатьПоМаксимальномуТарифу = Ложь) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("смартНаценкаПоДоставкеРассчитана", Ложь);
	Результат.Вставить("смартНаценкаПоДоставке", Неопределено);
	Результат.Вставить("смартНаценкаПоДоставкеСумма", 0);
	Результат.Вставить("смартНаценкаПоДоставкеРассчитанаСОшибкой", Ложь);
	Результат.Вставить("смартНаценкаПоДоставкеОписаниеОшибки", "");
	Результат.Вставить("смартНаценкаПоДоставкеПоТарифу", Неопределено);
	Результат.Вставить("смартНаценкаПоДоставкеСуммаПоТарифу", 0);
	
	ДоставкаПоТарифу = РассчитатьДоставкуПоЗаказуКлиента(ЗаказКлиента, УчитыватьОтгруженныеЗаказы, СчитатьПоМаксимальномуТарифу);
	
	Результат.Вставить("ДополнительныеДанные", ДоставкаПоТарифу.ДополнительныеДанные);
	
	Запрос = Новый Запрос;
	
	Если ТипЗнч(ЗаказКлиента) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаказКлиентаСкидкиНаценки.СкидкаНаценка КАК СкидкаНаценка,
		|	СУММА(ЗаказКлиентаСкидкиНаценки.Сумма) КАК Сумма
		|ИЗ
		|	Документ.ЗаказКлиента.СкидкиНаценки КАК ЗаказКлиентаСкидкиНаценки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.смартТарифыНаДоставку.СрезПоследних(&ДатаЗаказа, ) КАК смартТарифыНаДоставкуСрезПоследних
		|		ПО ЗаказКлиентаСкидкиНаценки.СкидкаНаценка = смартТарифыНаДоставкуСрезПоследних.СкидкаНаценка
		|			И НЕ смартТарифыНаДоставкуСрезПоследних.НеИспользуется
		|ГДЕ
		|	ЗаказКлиентаСкидкиНаценки.Ссылка В (&ЗаказКлиента)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказКлиентаСкидкиНаценки.СкидкаНаценка";
		
		МассивЗаказов = ДоставкаПоТарифу.ДополнительныеДанные.Заказы.ВыгрузитьКолонку("Ссылка");
		МассивЗаказов.Добавить(ЗаказКлиента);
		
		Запрос.УстановитьПараметр("ДатаЗаказа", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗаказКлиента, "Дата"));
		Запрос.УстановитьПараметр("ЗаказКлиента", МассивЗаказов);
		
	Иначе
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Т.СкидкаНаценка КАК СкидкаНаценка,
		|	Т.Сумма КАК Сумма
		|ПОМЕСТИТЬ ВТСкидкиНаценки
		|ИЗ
		|	&ТЗ КАК Т
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Т.СкидкаНаценка КАК СкидкаНаценка,
		|	Т.Сумма КАК Сумма
		|ПОМЕСТИТЬ ВТСкидкиНаценкиФинальные
		|ИЗ
		|	ВТСкидкиНаценки КАК Т
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗаказКлиентаСкидкиНаценки.СкидкаНаценка,
		|	СУММА(ЗаказКлиентаСкидкиНаценки.Сумма)
		|ИЗ
		|	Документ.ЗаказКлиента.СкидкиНаценки КАК ЗаказКлиентаСкидкиНаценки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.смартТарифыНаДоставку.СрезПоследних(&ДатаЗаказа, ) КАК смартТарифыНаДоставкуСрезПоследних
		|		ПО ЗаказКлиентаСкидкиНаценки.СкидкаНаценка = смартТарифыНаДоставкуСрезПоследних.СкидкаНаценка
		|			И (НЕ смартТарифыНаДоставкуСрезПоследних.НеИспользуется)
		|ГДЕ
		|	ЗаказКлиентаСкидкиНаценки.Ссылка В(&ЗаказКлиента)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказКлиентаСкидкиНаценки.СкидкаНаценка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТСкидкиНаценки.СкидкаНаценка КАК СкидкаНаценка,
		|	СУММА(ВТСкидкиНаценки.Сумма) КАК Сумма
		|ИЗ
		|	ВТСкидкиНаценкиФинальные КАК ВТСкидкиНаценки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.смартТарифыНаДоставку.СрезПоследних(&ДатаЗаказа, ) КАК смартТарифыНаДоставкуСрезПоследних
		|		ПО ВТСкидкиНаценки.СкидкаНаценка = смартТарифыНаДоставкуСрезПоследних.СкидкаНаценка
		|			И (НЕ смартТарифыНаДоставкуСрезПоследних.НеИспользуется)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТСкидкиНаценки.СкидкаНаценка";
		
		МассивЗаказов = ДоставкаПоТарифу.ДополнительныеДанные.Заказы.ВыгрузитьКолонку("Ссылка");
		
		Запрос.УстановитьПараметр("ДатаЗаказа", ЗаказКлиента.Дата);
		Запрос.УстановитьПараметр("ТЗ", ЗаказКлиента.СкидкиНаценки.Выгрузить());
		Запрос.УстановитьПараметр("ЗаказКлиента", МассивЗаказов);
		
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Результат.смартНаценкаПоДоставкеРассчитана = Истина;
		Результат.смартНаценкаПоДоставке = Выборка.СкидкаНаценка;
		Результат.смартНаценкаПоДоставкеСумма = - Выборка.Сумма;
		
	КонецЦикла;
	
	Результат.смартНаценкаПоДоставкеПоТарифу = ДоставкаПоТарифу.СкидкаНаценка;
	Результат.смартНаценкаПоДоставкеСуммаПоТарифу = ДоставкаПоТарифу.СтоимостьДоставки;
	
	Если Результат.смартНаценкаПоДоставкеРассчитана И Результат.смартНаценкаПоДоставкеСумма <> 0 И НЕ ЗначениеЗаполнено(ДоставкаПоТарифу.СкидкаНаценка) И НЕ ПревышениеСуммыНеСчитаетсяОшибкой Тогда
		
		Результат.смартНаценкаПоДоставкеРассчитанаСОшибкой = Истина;
		Результат.смартНаценкаПоДоставкеОписаниеОшибки = "Наценка на доставку > 0, по тарифам доставки нет";
		
	ИначеЕсли Результат.смартНаценкаПоДоставкеРассчитана И Результат.смартНаценкаПоДоставкеСумма <> 0 И ЗначениеЗаполнено(ДоставкаПоТарифу.СкидкаНаценка) Тогда
		
		Если ДоставкаПоТарифу.СкидкаНаценка <> Результат.смартНаценкаПоДоставке И Результат.смартНаценкаПоДоставкеСумма = ДоставкаПоТарифу.СтоимостьДоставки Тогда
			
			Если НЕ (ПревышениеСуммыНеСчитаетсяОшибкой И Результат.смартНаценкаПоДоставкеСумма > ДоставкаПоТарифу.СтоимостьДоставки) Тогда
				
				Результат.смартНаценкаПоДоставкеРассчитанаСОшибкой = Истина;
				Результат.смартНаценкаПоДоставкеОписаниеОшибки = "Выбран неверный вид наценки";
				
			КонецЕсли;
			
		ИначеЕсли Результат.смартНаценкаПоДоставкеСумма <> ДоставкаПоТарифу.СтоимостьДоставки Тогда
			
			Если НЕ (ПревышениеСуммыНеСчитаетсяОшибкой И Результат.смартНаценкаПоДоставкеСумма > ДоставкаПоТарифу.СтоимостьДоставки) Тогда
				
				Результат.смартНаценкаПоДоставкеРассчитанаСОшибкой = Истина;
				Результат.смартНаценкаПоДоставкеОписаниеОшибки = СтрШаблон("Неверное рассчитана сумма доставки. Минимальная стоимость доставки %1", ДоставкаПоТарифу.СтоимостьДоставки);
				
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли НЕ Результат.смартНаценкаПоДоставкеРассчитана И ЗначениеЗаполнено(ДоставкаПоТарифу.СкидкаНаценка) Тогда
		
		Результат.смартНаценкаПоДоставкеРассчитанаСОшибкой = Истина;
		Результат.смартНаценкаПоДоставкеОписаниеОшибки = СтрШаблон("Необходимо было рассчитать доставку. Наценка %1, сумма %2", ДоставкаПоТарифу.СкидкаНаценка, ДоставкаПоТарифу.СтоимостьДоставки);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СуществуетДоставкаДоКлиентаВРегионе(РегионДоставки, ГородДоставки, РасстояниеДоставки) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	смартТарифыНаДоставкуСрезПоследних.Регион КАК Регион
	|ИЗ
	|	РегистрСведений.смартТарифыНаДоставку.СрезПоследних(
	|			,
	|			Регион = &РегионДоставки
	|				И (Город = &ГородДоставки
	|					ИЛИ Город = """")
	|				И Расстояние >= &РасстояниеДоставки) КАК смартТарифыНаДоставкуСрезПоследних
	|ГДЕ
	|	НЕ смартТарифыНаДоставкуСрезПоследних.НеИспользуется";
	
	Запрос.УстановитьПараметр("РегионДоставки", РегионДоставки);
	Запрос.УстановитьПараметр("ГородДоставки", ГородДоставки);
	Запрос.УстановитьПараметр("РасстояниеДоставки", РасстояниеДоставки);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И Выборка.Регион <> NULL Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ПолучитьРассчитаннуюСуммуДоставки(ЗаказКлиента) Экспорт
	
	Запрос = Новый Запрос;
	
	Если ТипЗнч(ЗаказКлиента) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СУММА(-ЗаказКлиентаСкидкиНаценки.Сумма) КАК СуммаДоставки
		|ИЗ
		|	Документ.ЗаказКлиента.СкидкиНаценки КАК ЗаказКлиентаСкидкиНаценки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.смартТарифыНаДоставку.СрезПоследних(&ДатаЗаказа, ) КАК смартТарифыНаДоставкуСрезПоследних
		|		ПО ЗаказКлиентаСкидкиНаценки.СкидкаНаценка = смартТарифыНаДоставкуСрезПоследних.СкидкаНаценка
		|			И (НЕ смартТарифыНаДоставкуСрезПоследних.НеИспользуется)
		|ГДЕ
		|	ЗаказКлиентаСкидкиНаценки.Ссылка = &ЗаказКлиента";
		
		Запрос.УстановитьПараметр("ЗаказКлиента", ЗаказКлиента);
		Запрос.УстановитьПараметр("ДатаЗаказа", ЗаказКлиента.Дата);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() И Выборка.СуммаДоставки <> NULL Тогда
			Возврат Выборка.СуммаДоставки;
		КонецЕсли;
		
		Возврат 0;
		
	Иначе
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Т.СкидкаНаценка КАК СкидкаНаценка,
		|	- Т.Сумма КАК Сумма
		|ПОМЕСТИТЬ ВТСкидкиНаценки
		|ИЗ
		|	&ТЗ КАК Т
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВТСкидкиНаценки.Сумма) КАК СуммаДоставки
		|ИЗ
		|	ВТСкидкиНаценки КАК ВТСкидкиНаценки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.смартТарифыНаДоставку.СрезПоследних(&ДатаЗаказа, ) КАК смартТарифыНаДоставкуСрезПоследних
		|		ПО ВТСкидкиНаценки.СкидкаНаценка = смартТарифыНаДоставкуСрезПоследних.СкидкаНаценка
		|			И (НЕ смартТарифыНаДоставкуСрезПоследних.НеИспользуется)";
		
		Запрос.УстановитьПараметр("ТЗ", ЗаказКлиента.СкидкиНаценки.Выгрузить());
		Запрос.УстановитьПараметр("ДатаЗаказа", ЗаказКлиента.Дата);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() И Выборка.СуммаДоставки <> NULL Тогда
			Возврат Выборка.СуммаДоставки;
		КонецЕсли;
		
		Возврат 0;
		
	КонецЕсли;
															
КонецФункции

#КонецОбласти
